{
    "story_id": "lean_startup_quest",
    "languages": ["ar"],
    "nodes": [
        {
            "node_id": "start",
            "text_ar": "أنت رائد أعمال طموح ولديك فكرة تطبيق ثورية. مهمتك: بناء شركة ناشئة ناجحة باستخدام مبادئ \"الشركة الناشئة المرنة\". ما هي خطوتك الأولى؟",
            "image_url": "node-1-image.jpg",
            "choices": [
                {
                    "choice_text_ar": "قضاء الأشهر الستة القادمة في بناء التطبيق الكامل بكل ميزاته.",
                    "next_node_id": "build_full_product"
                },
                {
                    "choice_text_ar": "إنشاء صفحة هبوط بسيطة لقياس الاهتمام والتحقق من المشكلة.",
                    "next_node_id": "create_landing_page"
                }
            ]
        },
        {
            "node_id": "build_full_product",
            "text_ar": "بعد ستة أشهر من العمل الشاق، تطلق تطبيقك. لكنك تكتشف أن لا أحد يريد استخدامه. لقد بنيت منتجًا لا أحد يحتاجه. هذا فشل شائع. مبدأ الشركة الناشئة المرنة الرئيسي هو تجنب هذه النتيجة عن طريق التعلم والتحقق أولاً. هل تريد المحاولة مرة أخرى؟",
            "image_url": "node-2-image.jpg",
            "choices": [
                {
                    "choice_text_ar": "نعم، لنبدأ من جديد بالمنهجية المرنة.",
                    "next_node_id": "start"
                }
            ]
        },
        {
            "node_id": "create_landing_page",
            "text_ar": "اختيار ذكي! تجمع صفحتك المقصودة 500 اشتراك بالبريد الإلكتروني في الأسبوع الأول. لقد تحققت من أن المشكلة حقيقية وأن الناس مهتمون بالحل. هذا هو \"التعلم المتحقق منه\" في العمل. الآن، ما هو منتجك الأولي الأدنى (MVP)؟",
            "image_url": "node-3-image.jpg",
            "choices": [
                {
                    "choice_text_ar": "أداة بسيطة عبر الإنترنت تقوم بوظيفة أساسية واحدة فقط.",
                    "next_node_id": "simple_tool_mvp"
                },
                {
                    "choice_text_ar": "تطبيق جوال بميزات أساسية، ولكن بتصميم مصقول.",
                    "next_node_id": "polished_app_mvp"
                }
            ]
        },
        {
            "node_id": "simple_tool_mvp",
            "text_ar": "ممتاز. تطلق الأداة البسيطة لمشتركي بريدك الإلكتروني. يقدمون ملاحظات لا تقدر بثمن. تكتشف أنهم يستخدمون أداتك بطريقة لم تتوقعها. هذه رؤية حاسمة! حان الوقت لـ \"التكيف\" - تغيير استراتيجي في المنتج بناءً على التعلم. ماذا تفعل؟",
            "image_url": "node-4-image.jpg",
            "choices": [
                {
                    "choice_text_ar": "تجاهل ملاحظاتهم والالتزام برؤيتك الأصلية.",
                    "next_node_id": "ignore_feedback"
                },
                {
                    "choice_text_ar": "التكيف لتلبية الاحتياجات غير المتوقعة التي اكتشفتها.",
                    "next_node_id": "pivot"
                }
            ]
        },
        {
            "node_id": "polished_app_mvp",
            "text_ar": "لقد استغرقت 3 أشهر لبناء التطبيق المصقول. إنه يعمل بشكل جيد، لكن المستخدمين الأوائل يطلبون ميزة مختلفة تمامًا. لقد أنفقت وقتًا وموارد ثمينة على بناء شيء يحتاج إلى تغيير كبير. كان من الممكن أن يكون MVP أبسط قد وفر لك هذا الوقت. هل تريد أن تجرب مسار MVP الآخر؟",
            "image_url": "node-5-image.jpg",
            "choices": [
                {
                    "choice_text_ar": "نعم، لنجرب MVP الأداة البسيطة.",
                    "next_node_id": "simple_tool_mvp"
                }
            ]
        },
        {
            "node_id": "ignore_feedback",
            "text_ar": "من خلال تجاهل ملاحظات المستخدمين، فإنك تقع في فخ بناء شيء لا يريده أحد. لقد فشل منتجك في اكتساب قوة جذب. الدرس الأساسي في الشركة الناشئة المرنة هو الاستماع إلى عملائك. النهاية.",
            "image_url": "node-6-image.jpg"
        },
        {
            "node_id": "pivot",
            "text_ar": "لقد قمت بالتكيف بنجاح! منتجك الجديد، الذي يستهدف الحاجة الحقيقية التي اكتشفتها، يحقق نجاحًا كبيرًا. لقد بنيت حلقة \"بناء-قياس-تعلم\" فعالة. لقد تحولت من مجرد فكرة إلى شركة ناشئة مستدامة. تهانينا، لقد أتقنت أساسيات الشركة الناشئة المرنة! النهاية.",
            "image_url": "node-7-image.jpg"
        }
    ]
}
